Tekla.Structures.CatalogInternal.MeshItemEnumerator_t
The MeshItemEnumerator_t structure.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.IndexToStart
The index to start from.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.MeshItems
The number of mesh items in the enumerator.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.Grade
The mesh grade list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.Name
The mesh name list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.DiameterLongitudinal
The mesh longitudinal bar size list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.DistanceLongitudinal
The mesh longitudinal pitch list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.Length
The mesh longitudinal mesh size (Length) list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.MinimumOverlappingLongitudinal
The mesh longitudinal minimum overlapping list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.MaximumOverlappingLongitudinal
The mesh longitudinal maximum overlapping list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.LeftOverhangLongitudinal
The mesh longitudinal left overhang list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.RightOverhangLongitudinal
The mesh longitudinal right overhang list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.DiameterCross
The mesh cross bar size list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.DistanceCross
The mesh cross pitch list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.Width
The mesh cross mesh size (Width) list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.MinimumOverlappingCross
The mesh cross minimum overlapping list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.MaximumOverlappingCross
The mesh cross maximum overlapping list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.LeftOverhangCross
The mesh cross left overhang list.

Tekla.Structures.CatalogInternal.MeshItemEnumerator_t.RightOverhangCross
The mesh cross right overhang list.